diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отпуска</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оплачиваемый</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	
	Для Каждого Сотрудник Из Отпуска Цикл
	    СтатусСотрудника = ВКМ_РасчетыИНачисления.ПроверкаСтатусаСотрудника(Сотрудник.Сотрудник, Год);
	    Если Не СтатусСотрудника Тогда
	    	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 не является трудоустроенным сотрудником на дату документа", Сотрудник.Сотрудник), 
	    	        ЭтотОбъект, "Отпуска[" + Сотрудник.НомерСтроки + "].Сотрудник", "Объект", Отказ);
	    	Продолжить
	    КонецЕсли;
	    
	    КонецОтпуска = Сотрудник.ДатаОкончания;
	    	    
	    Если  Сотрудник.ДнейОтпуска > 28 Тогда
	    	НеоплачиваемыхДней = (Сотрудник.ДнейОтпуска - 28) * 86400;
	    	КонецОтпуска = Сотрудник.ДатаОкончания - НеоплачиваемыхДней; 	
	    
            Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
            Движение.Период = Год;
            Движение.Оплачиваемый = Ложь;
            Движение.Сотрудник = Сотрудник.Сотрудник;
            Движение.ДатаНачала = Сотрудник.ДатаОкончания - НеоплачиваемыхДней + 86400;
            Движение.ДатаОкончания = Сотрудник.ДатаОкончания;
    
	    КонецЕсли;
	    Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
	    Движение.Период = Год;
	    Движение.Оплачиваемый = Истина;
	    Движение.Сотрудник = Сотрудник.Сотрудник;
	    Движение.ДатаНачала = Сотрудник.ДатаНачала;
	    Движение.ДатаОкончания =  КонецОтпуска;
	    	
		
	КонецЦикла;


КонецПроцедуры
#КонецОбласти

#КонецЕсли
